romavis/STM32_Experiments/include/arch/stm32f4_mmiomap.h
#ifndef STM32F4_MMIOMAP_H
#define STM32F4_MMIOMAP_H

/*
 * STM32F4 Peripheral MMIO base addresses
 *
 * Copyright (C) 2013 Roman Dobrodiy <ztcoils _d@g_ gmail.com>
 *
 * All rights reserved. This program and the accompanying materials
 * are made available under the terms of the GNU Lesser General Public License
 * (LGPL) version 2.1 which accompanies this distribution, and is available at
 * http://www.gnu.org/licenses/lgpl-2.1.html
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
 * Lesser General Public License for more details.
 */

/* Definition name format: STM32F4_MMIO_BASE_<peripheral> */

/* APB1 */
#define STM32F4_MMIO_BASE_TIM2		0x40000000
#define STM32F4_MMIO_BASE_TIM3		0x40000400
#define STM32F4_MMIO_BASE_TIM4		0x40000800
#define STM32F4_MMIO_BASE_TIM5		0x40000C00
#define STM32F4_MMIO_BASE_TIM6		0x40001000
#define STM32F4_MMIO_BASE_TIM7		0x40001400
#define STM32F4_MMIO_BASE_TIM12		0x40001800
#define STM32F4_MMIO_BASE_TIM13		0x40001C00
#define STM32F4_MMIO_BASE_TIM14		0x40002000
#define STM32F4_MMIO_BASE_RTC_BKP	0x40002800
#define STM32F4_MMIO_BASE_WWDG		0x40002C00
#define STM32F4_MMIO_BASE_IWDG		0x40003000
#define STM32F4_MMIO_BASE_I2S2ext	0x40003400
#define STM32F4_MMIO_BASE_SPI2_I2S2	0x40003800
#define STM32F4_MMIO_BASE_SPI3_I2S3	0x40003C00
#define STM32F4_MMIO_BASE_I2S3ext	0x40004000
#define STM32F4_MMIO_BASE_USART2	0x40004400
#define STM32F4_MMIO_BASE_USART3	0x40004800
#define STM32F4_MMIO_BASE_UART4		0x40004C00
#define STM32F4_MMIO_BASE_UART5		0x40005000
#define STM32F4_MMIO_BASE_I2C1		0x40005400
#define STM32F4_MMIO_BASE_I2C2		0x40005800
#define STM32F4_MMIO_BASE_I2C3		0x40005C00
#define STM32F4_MMIO_BASE_CAN1		0x40006400
#define STM32F4_MMIO_BASE_CAN2		0x40006800
#define STM32F4_MMIO_BASE_PWR		0x40007000
#define STM32F4_MMIO_BASE_DAC		0x40007400
#define STM32F4_MMIO_BASE_UART7		0x40007800
#define STM32F4_MMIO_BASE_UART8		0x40007C00
/* APB2 */
#define STM32F4_MMIO_BASE_TIM1		0x40010000
#define STM32F4_MMIO_BASE_TIM8		0x40010400
#define STM32F4_MMIO_BASE_USART1	0x40011000
#define STM32F4_MMIO_BASE_USART6	0x40011400
#define STM32F4_MMIO_BASE_ADC		0x40012000
#define STM32F4_MMIO_BASE_SDIO		0x40012C00
#define STM32F4_MMIO_BASE_SPI1		0x40013000
#define STM32F4_MMIO_BASE_SPI4		0x40013400
#define STM32F4_MMIO_BASE_SYSCFG	0x40013800
#define STM32F4_MMIO_BASE_EXTI		0x40013C00
#define STM32F4_MMIO_BASE_TIM9		0x40014000
#define STM32F4_MMIO_BASE_TIM10		0x40014400
#define STM32F4_MMIO_BASE_TIM11		0x40014800
#define STM32F4_MMIO_BASE_SPI5		0x40015000
#define STM32F4_MMIO_BASE_SPI6		0x40015400
#define STM32F4_MMIO_BASE_SAI1		0x40015800
#define STM32F4_MMIO_BASE_LCD_TFT	0x40016800
/* AHB1 */
#define STM32F4_MMIO_BASE_GPIOA		0x40020000
#define STM32F4_MMIO_BASE_GPIOB		0x40020400
#define STM32F4_MMIO_BASE_GPIOC		0x40020800
#define STM32F4_MMIO_BASE_GPIOD		0x40020C00
#define STM32F4_MMIO_BASE_GPIOE		0x40021000
#define STM32F4_MMIO_BASE_GPIOF		0x40021400
#define STM32F4_MMIO_BASE_GPIOG		0x40021800
#define STM32F4_MMIO_BASE_GPIOH		0x40021C00
#define STM32F4_MMIO_BASE_GPIOI		0x40022000
#define STM32F4_MMIO_BASE_GPIOJ		0x40022400
#define STM32F4_MMIO_BASE_GPIOK		0x40022800
#define STM32F4_MMIO_BASE_CRC		0x40023000
#define STM32F4_MMIO_BASE_RCC		0x40023800
#define STM32F4_MMIO_BASE_FLASH		0x40023C00
#define STM32F4_MMIO_BASE_DMA1		0x40026000
#define STM32F4_MMIO_BASE_DMA2		0x40026400
#define STM32F4_MMIO_BASE_MAC		0x40028000
#define STM32F4_MMIO_BASE_DMA2D		0x4002B000
#define STM32F4_MMIO_BASE_OTG_HS	0x40040000
/* AHB2 */
#define STM32F4_MMIO_BASE_OTG_FS	0x50000000
#define STM32F4_MMIO_BASE_DCMI		0x50050000
#define STM32F4_MMIO_BASE_CRYPTO	0x50060000
#define STM32F4_MMIO_BASE_HASH		0x50060400
#define STM32F4_MMIO_BASE_RNG		0x50060800
/* AHB3 */
#define STM32F4_MMIO_BASE_FSMC		0xA0000000

#endif /* STM32F4_MMIOMAP_H */
